#ifndef _GNU_SOURCE
#define _GNU_SOURCE 1
#endif
#include <assert.h>
#include <errno.h>
#include <inttypes.h>
#include <limits.h>
#include <stdarg.h>
#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include <err.h>
#include <fcntl.h>
#include <getopt.h>
#include <linux/fs.h>
#include <sys/file.h>
#include <sys/ioctl.h>
#include <sys/stat.h>
#include <sys/sysmacros.h>
#include <unistd.h>

#include <zlib.h>

// Disable some warnings that are not helpful and will not be fixed.

#ifdef __clang__
// C89/C90/C94 are not supported.
#pragma clang diagnostic ignored "-Wdeclaration-after-statement"
// This warning is good for security, but it requires massive
// changes to how C code is written, and this code is still written
// in the unsafe "traditional" style.
#pragma clang diagnostic ignored "-Wunsafe-buffer-usage"
#endif

#if __BYTE_ORDER__ != __ORDER_LITTLE_ENDIAN__
#error Only little-endian machines are supported
#endif

// Exit codes:
// 0: everything OK
// 1: unspecified error
// 2: I/O error
// 3: GPT might be valid but uses unsupported feature
// 4: No partition table found
// 5: GPT invalid, missing, or corrupt
// 6: Cannot create new GPT because of some constraint
// 7: Device needs fixing but "check" is passed
// 8: Disk appears truncated
#define EXIT_IO 2
#define EXIT_UNSUPPORTED 3
#define EXIT_NOT_PARTITIONED 4
#define EXIT_INVALID_GPT 5
#define EXIT_CONSTRAINT 6
#define EXIT_NEEDS_FIX 7
#define EXIT_TRUNCATED 8

struct ChsSpec {
    uint8_t spec[3];
};

struct Guid {
    uint32_t first;
    uint16_t second, third;
    uint8_t rest[8];
} __attribute__((packed, aligned(1)));

struct GPTHeader {
    uint8_t Signature[8];              /*  0 */
    uint32_t Revision;                 /*  8 */
    uint32_t HeaderSize;               /* 12 */
    uint32_t HeaderCRC32;              /* 16 */
    uint32_t Reserved;                 /* 20 */
    uint64_t MyLBA;                    /* 24 */
    uint64_t AlternateLBA;             /* 32 */
    uint64_t FirstUsableLBA;           /* 40 */
    uint64_t LastUsableLBA;            /* 48 */
    struct Guid DiskGUID;              /* 56 */
    uint64_t PartitionEntryLBA;        /* 72 */
    uint32_t NumberOfPartitionEntries; /* 80 */
    uint32_t SizeOfPartitionEntry;     /* 84 */
    uint32_t PartitionEntryArrayCRC32; /* 88 */
} __attribute__((packed, aligned(1)));
static_assert(sizeof(struct GPTHeader) == 92, "bug");

struct GPTPartitionEntry {
    struct Guid PartitionTypeGUID;   /*   0 */
    struct Guid UniquePartitionGUID; /*  16 */
    uint64_t StartingLBA;            /*  32 */
    uint64_t EndingLBA;              /*  40 */
    uint64_t Attributes;             /*  48 */
    uint8_t PartitionName[72];       /*  56 */
} __attribute__((packed, aligned(1)));
static_assert(sizeof(struct GPTPartitionEntry) == 128, "bug");

struct __attribute__((aligned(1))) MbrPartitionRecord {
    uint8_t boot_indicator;
    struct ChsSpec starting_chs;
    uint8_t os_type;
    struct ChsSpec ending_chs;
    uint8_t starting_lba[4];
    uint8_t size_in_lba[4];
};
#define ASSERT_OFFSET(a, b, offset, size)                                                                              \
    static_assert(offsetof(a, b) == offset, "wrong offset");                                                           \
    static_assert(sizeof(((a){0}).b) == size, "wrong size");
ASSERT_OFFSET(struct MbrPartitionRecord, boot_indicator, 0, 1)
ASSERT_OFFSET(struct MbrPartitionRecord, starting_chs, 1, 3)
ASSERT_OFFSET(struct MbrPartitionRecord, os_type, 4, 1)
ASSERT_OFFSET(struct MbrPartitionRecord, ending_chs, 5, 3)
ASSERT_OFFSET(struct MbrPartitionRecord, starting_lba, 8, 4)
